In [1]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
from getpass import getpass  # To get the password without showing the input

In [2]:
password = getpass()

········

In [4]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/bank'
engine = create_engine(connection_string)

How many distinct (different) actors' last names are there?

In [6]:
query= '''select COUNT(DISTINCT last_name) as diferent_last_names from sakila.actor;'''
data = pd.read_sql_query(query, engine)
data.head()

   diferent_last_names
0                  121

Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

In [13]:
query= '''SELECT *, CASE
WHEN dayname(rental_date) = 'Saturday' then 'Weekend'
WHEN dayname(rental_date) = 'Sunday' then 'Weekend'
ELSE 'Workday'
END AS 'day_type'
FROM sakila.rental;'''
data = pd.read_sql_query(query, engine)
data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,Workday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,Workday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,Workday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,Workday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,Workday

Get all films with ARMAGEDDON in the title.

In [27]:
query= '''SELECT title FROM sakila.film
WHERE title LIKE '%%ARMAGEDDON%%';'''
data = pd.read_sql_query(query, engine)
data.head()

                   title
0        ARMAGEDDON LOST
1    LADYBUGS ARMAGEDDON
2       METAL ARMAGEDDON
3    MOSQUITO ARMAGEDDON
4  STAGECOACH ARMAGEDDON

Get 10 the longest films.

In [20]:
query= '''SELECT length AS 'top10_max_duration' FROM sakila.film
ORDER BY length DESC #Descending order of film duration
LIMIT 10; # limit the query to 10 rows'''
data = pd.read_sql_query(query, engine)
data.head()

   top10_max_duration
0                 185
1                 185
2                 185
3                 185
4                 185

How many films include Behind the Scenes content?

In [28]:
query= '''SELECT special_features FROM sakila.film
WHERE special_features LIKE '%%Behind the Scenes%%'; #% acts as a match card.'''
data = pd.read_sql_query(query, engine)
data.head()

                            special_features
0           Deleted Scenes,Behind the Scenes
1             Commentaries,Behind the Scenes
2             Commentaries,Behind the Scenes
3           Deleted Scenes,Behind the Scenes
4  Trailers,Deleted Scenes,Behind the Scenes

Which kind of movies (rating) have a mean duration of more than two hours?

In [24]:
query= '''SELECT rating, AVG(length) AS average FROM sakila.film
GROUP BY rating
HAVING average>120;'''
data = pd.read_sql_query(query, engine)
data.head()

  rating   average
0  PG-13  120.4439

Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [26]:
query= '''SELECT title, length, 
RANK() OVER(ORDER BY length DESC) AS Ranking
FROM sakila.film
WHERE (length IS NOT NULL) AND (length <> 0); '''
data = pd.read_sql_query(query, engine)
data.head()

            title  length  Ranking
0   CHICAGO NORTH     185        1
1  CONTROL ANTHEM     185        1
2  DARN FORRESTER     185        1
3     GANGS PRIDE     185        1
4       HOME PITY     185        1